my bad, the hardcoded value was in the wrong place.

Now it's in the right place, but as I said previously, every value is marking the key for deletion, not only api_version:

Terraform will perform the following actions:

```
  # module.confluent-environment.data.confluent_schema_registry_cluster.schema_registry_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "confluent_schema_registry_cluster" "schema_registry_cluster" {
      + api_version   = (known after apply)
      + display_name  = (known after apply)
      + id            = (known after apply)
      + kind          = (known after apply)
      + package       = (known after apply)
      + region        = (known after apply)
      + resource_name = (known after apply)
      + rest_endpoint = (known after apply)

      + environment {
          + id = "t27797"
        }
    }

  # module.confluent-environment.confluent_api_key.schema_registry must be replaced
-/+ resource "confluent_api_key" "schema_registry" {
      ~ id                     = "4TCAK7PBN32UNYQ4" -> (known after apply)
      ~ secret                 = (sensitive value)
        # (3 unchanged attributes hidden)

      ~ managed_resource {
          ~ id          = "lsrc-m8kz1" # forces replacement -> (known after apply) # forces replacement
          ~ kind        = "Cluster" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.confluent-environment.confluent_environment.environment will be updated in-place
  ~ resource "confluent_environment" "environment" {
        id            = "t27797"
        # (2 unchanged attributes hidden)

      ~ stream_governance {
          + package = "ESSENTIALS"
        }
    }

  # module.confluent-environment.confluent_role_binding.schema_registry must be replaced
-/+ resource "confluent_role_binding" "schema_registry" {
      ~ crn_pattern = "crn://confluent.cloud/organization=5583eaa6-bbbc-4e08-87f0-0986342aedc0/environment=t27797/schema-registry=lsrc-m8kz1/subject=*" # forces replacement -> (known after apply) # forces replacement
      ~ id          = "rb-1oMyR" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ schema_registry    = (sensitive value)
```